paper/get_set_benchmark/raw/redis-get-set-1-9.txt
4         Threads
64        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       401770.02          ---          ---         4.07337         4.19100         4.92700         5.63100     30559.66 
Gets      3615930.21    777907.12   2838023.09         4.07334         4.19100         4.92700         5.63100    163150.68 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    4017700.23    777907.12   2838023.09         4.07334         4.19100         4.92700         5.63100    193710.34 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       2.591        5.000
SET       3.407       10.000
SET       3.743       15.000
SET       3.855       20.000
SET       3.919       25.000
SET       3.983       30.000
SET       4.031       35.000
SET       4.095       40.000
SET       4.159       45.000
SET       4.191       50.000
SET       4.223       52.500
SET       4.255       55.000
SET       4.287       57.500
SET       4.287       60.000
SET       4.319       62.500
SET       4.351       65.000
SET       4.383       67.500
SET       4.415       70.000
SET       4.447       72.500
SET       4.447       75.000
SET       4.479       76.250
SET       4.479       77.500
SET       4.511       78.750
SET       4.511       80.000
SET       4.543       81.250
SET       4.543       82.500
SET       4.543       83.750
SET       4.575       85.000
SET       4.575       86.250
SET       4.607       87.500
SET       4.607       88.125
SET       4.639       88.750
SET       4.639       89.375
SET       4.639       90.000
SET       4.671       90.625
SET       4.671       91.250
SET       4.671       91.875
SET       4.703       92.500
SET       4.703       93.125
SET       4.703       93.750
SET       4.735       94.062
SET       4.735       94.375
SET       4.735       94.688
SET       4.735       95.000
SET       4.767       95.312
SET       4.767       95.625
SET       4.767       95.938
SET       4.767       96.250
SET       4.799       96.562
SET       4.799       96.875
SET       4.799       97.031
SET       4.831       97.188
SET       4.831       97.344
SET       4.831       97.500
SET       4.831       97.656
SET       4.831       97.812
SET       4.863       97.969
SET       4.863       98.125
SET       4.863       98.281
SET       4.895       98.438
SET       4.895       98.516
SET       4.895       98.594
SET       4.895       98.672
SET       4.895       98.750
SET       4.927       98.828
SET       4.927       98.906
SET       4.927       98.984
SET       4.959       99.062
SET       4.959       99.141
SET       4.959       99.219
SET       4.959       99.258
SET       4.991       99.297
SET       4.991       99.336
SET       4.991       99.375
SET       4.991       99.414
SET       5.023       99.453
SET       5.023       99.492
SET       5.023       99.531
SET       5.055       99.570
SET       5.055       99.609
SET       5.087       99.629
SET       5.087       99.648
SET       5.087       99.668
SET       5.119       99.688
SET       5.119       99.707
SET       5.151       99.727
SET       5.183       99.746
SET       5.183       99.766
SET       5.215       99.785
SET       5.279       99.805
SET       5.279       99.814
SET       5.311       99.824
SET       5.343       99.834
SET       5.375       99.844
SET       5.407       99.854
SET       5.439       99.863
SET       5.503       99.873
SET       5.535       99.883
SET       5.567       99.893
SET       5.631       99.902
SET       5.663       99.907
SET       5.695       99.912
SET       5.727       99.917
SET       5.759       99.922
SET       5.791       99.927
SET       5.823       99.932
SET       5.855       99.937
SET       5.919       99.941
SET       5.951       99.946
SET       6.015       99.951
SET       6.047       99.954
SET       6.079       99.956
SET       6.111       99.958
SET       6.143       99.961
SET       6.207       99.963
SET       6.239       99.966
SET       6.303       99.968
SET       6.367       99.971
SET       6.463       99.973
SET       6.559       99.976
SET       6.623       99.977
SET       6.687       99.978
SET       6.751       99.979
SET       6.815       99.980
SET       6.911       99.982
SET       7.007       99.983
SET       7.135       99.984
SET       7.231       99.985
SET       7.327       99.987
SET       7.455       99.988
SET       7.519       99.988
SET       7.615       99.989
SET       7.679       99.990
SET       7.743       99.990
SET       7.807       99.991
SET       7.903       99.991
SET       7.999       99.992
SET       8.095       99.993
SET       8.255       99.993
SET       8.383       99.994
SET       8.511       99.994
SET       8.639       99.995
SET       8.767       99.995
SET       8.831       99.995
SET       8.895       99.995
SET       8.959       99.996
SET       9.023       99.996
SET       9.151       99.996
SET       9.215       99.997
SET       9.279       99.997
SET       9.279       99.997
SET       9.343       99.997
SET       9.343       99.997
SET       9.407       99.998
SET       9.407       99.998
SET       9.471       99.998
SET       9.535       99.998
SET       9.535       99.998
SET       9.599       99.998
SET       9.599       99.998
SET       9.663       99.999
SET       9.663       99.999
SET       9.663       99.999
[...]
SET       9.727       99.999
SET       9.727       99.999
SET       9.791       99.999
SET       9.855       99.999
SET       9.983       99.999
SET      10.047       99.999
SET      10.047       99.999
SET      10.111       99.999
SET      10.175       99.999
SET      10.239       99.999
SET      10.239       99.999
SET      10.303       99.999
SET      10.367      100.000
SET      10.367      100.000
SET      10.431      100.000
SET      10.495      100.000
SET      10.495      100.000
SET      10.559      100.000
SET      10.559      100.000
SET      10.559      100.000
SET      10.623      100.000
SET      10.623      100.000
SET      10.687      100.000
SET      10.687      100.000
SET      10.687      100.000
SET      10.751      100.000
SET      10.751      100.000
SET      10.751      100.000
[...]
SET      10.815      100.000
SET      10.815      100.000
SET      10.815      100.000
[...]
SET      10.879      100.000
SET      10.879      100.000
SET      10.879      100.000
[...]
SET      10.943      100.000
SET      10.943      100.000
---
GET       0.023        0.000
GET       2.591        5.000
GET       3.407       10.000
GET       3.743       15.000
GET       3.855       20.000
GET       3.919       25.000
GET       3.983       30.000
GET       4.031       35.000
GET       4.095       40.000
GET       4.159       45.000
GET       4.191       50.000
GET       4.223       52.500
GET       4.255       55.000
GET       4.287       57.500
GET       4.287       60.000
GET       4.319       62.500
GET       4.351       65.000
GET       4.383       67.500
GET       4.415       70.000
GET       4.447       72.500
GET       4.447       75.000
GET       4.479       76.250
GET       4.479       77.500
GET       4.511       78.750
GET       4.511       80.000
GET       4.543       81.250
GET       4.543       82.500
GET       4.543       83.750
GET       4.575       85.000
GET       4.575       86.250
GET       4.607       87.500
GET       4.607       88.125
GET       4.639       88.750
GET       4.639       89.375
GET       4.639       90.000
GET       4.671       90.625
GET       4.671       91.250
GET       4.671       91.875
GET       4.703       92.500
GET       4.703       93.125
GET       4.703       93.750
GET       4.735       94.062
GET       4.735       94.375
GET       4.735       94.688
GET       4.735       95.000
GET       4.767       95.312
GET       4.767       95.625
GET       4.767       95.938
GET       4.767       96.250
GET       4.799       96.562
GET       4.799       96.875
GET       4.799       97.031
GET       4.831       97.188
GET       4.831       97.344
GET       4.831       97.500
GET       4.831       97.656
GET       4.831       97.812
GET       4.863       97.969
GET       4.863       98.125
GET       4.863       98.281
GET       4.895       98.438
GET       4.895       98.516
GET       4.895       98.594
GET       4.895       98.672
GET       4.895       98.750
GET       4.927       98.828
GET       4.927       98.906
GET       4.927       98.984
GET       4.959       99.062
GET       4.959       99.141
GET       4.959       99.219
GET       4.959       99.258
GET       4.991       99.297
GET       4.991       99.336
GET       4.991       99.375
GET       4.991       99.414
GET       5.023       99.453
GET       5.023       99.492
GET       5.023       99.531
GET       5.055       99.570
GET       5.055       99.609
GET       5.087       99.629
GET       5.087       99.648
GET       5.087       99.668
GET       5.119       99.688
GET       5.119       99.707
GET       5.151       99.727
GET       5.151       99.746
GET       5.183       99.766
GET       5.215       99.785
GET       5.279       99.805
GET       5.279       99.814
GET       5.311       99.824
GET       5.343       99.834
GET       5.375       99.844
GET       5.407       99.854
GET       5.439       99.863
GET       5.503       99.873
GET       5.535       99.883
GET       5.567       99.893
GET       5.631       99.902
GET       5.663       99.907
GET       5.695       99.912
GET       5.727       99.917
GET       5.759       99.922
GET       5.791       99.927
GET       5.823       99.932
GET       5.855       99.937
GET       5.919       99.941
GET       5.951       99.946
GET       6.015       99.951
GET       6.047       99.954
GET       6.079       99.956
GET       6.111       99.958
GET       6.143       99.961
GET       6.207       99.963
GET       6.239       99.966
GET       6.335       99.968
GET       6.367       99.971
GET       6.463       99.973
GET       6.559       99.976
GET       6.623       99.977
GET       6.687       99.978
GET       6.751       99.979
GET       6.815       99.980
GET       6.911       99.982
GET       7.007       99.983
GET       7.135       99.984
GET       7.231       99.985
GET       7.327       99.987
GET       7.455       99.988
GET       7.519       99.988
GET       7.615       99.989
GET       7.679       99.990
GET       7.743       99.990
GET       7.807       99.991
GET       7.903       99.991
GET       7.999       99.992
GET       8.095       99.993
GET       8.255       99.993
GET       8.383       99.994
GET       8.511       99.994
GET       8.639       99.995
GET       8.767       99.995
GET       8.831       99.995
GET       8.895       99.995
GET       8.959       99.996
GET       9.023       99.996
GET       9.151       99.996
GET       9.215       99.997
GET       9.279       99.997
GET       9.279       99.997
GET       9.343       99.997
GET       9.343       99.997
GET       9.407       99.998
GET       9.407       99.998
GET       9.471       99.998
GET       9.535       99.998
GET       9.535       99.998
GET       9.599       99.998
GET       9.599       99.998
GET       9.599       99.999
GET       9.663       99.999
GET       9.663       99.999
GET       9.663       99.999
GET       9.727       99.999
GET       9.727       99.999
GET       9.791       99.999
GET       9.855       99.999
GET       9.983       99.999
GET      10.047       99.999
GET      10.047       99.999
GET      10.111       99.999
GET      10.111       99.999
GET      10.175       99.999
GET      10.239       99.999
GET      10.303       99.999
GET      10.367      100.000
GET      10.367      100.000
GET      10.431      100.000
GET      10.495      100.000
GET      10.495      100.000
GET      10.559      100.000
GET      10.559      100.000
GET      10.559      100.000
GET      10.623      100.000
GET      10.623      100.000
GET      10.687      100.000
GET      10.687      100.000
GET      10.687      100.000
GET      10.751      100.000
GET      10.751      100.000
GET      10.751      100.000
[...]
GET      10.815      100.000
GET      10.815      100.000
GET      10.815      100.000
[...]
GET      10.879      100.000
GET      10.879      100.000
GET      10.879      100.000
[...]
GET      10.943      100.000
GET      10.943      100.000
---
WAIT      0.000      100.000